#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-M2gHVw17enWBLXiF

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
random_password.db_password: Refreshing state... [id=none]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_dynamodb_table.state_locking: Refreshing state... [id=xgr00q-dev-state-locking]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_cloudwatch_event_rule.siteminder-tests-scheduler: Refreshing state... [id=siteminder-tests-scheduler]
aws_iam_role.api_gateway_s3_role: Refreshing state... [id=ApiGatewayAmazonS3AccessRole]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-api-swagger]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:220881534007:certificate/399165e3-6c0b-4264-940c-3a960e4b86b0]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.api: Refreshing state... [id=9jt82m]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=etb5fq]
aws_api_gateway_resource.app: Refreshing state... [id=guevy4]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=uysksd]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cmapde]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=qorb7e]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=ogj40z]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api-dev.loginproxy.gov.bc.ca]
aws_api_gateway_resource.app_proxy: Refreshing state... [id=bog9v3]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-dev-keycloak]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-gcp9dahm4c-uysksd-ANY]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-gcp9dahm4c-qorb7e-GET]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-gcp9dahm4c-ogj40z-GET]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-api-swagger]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-api-swagger,private]
aws_lambda_function.siteminder-tests-scheduler: Refreshing state... [id=lambda-siteminder-tests-scheduler]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_api_gateway_method.app_proxy: Refreshing state... [id=agm-gcp9dahm4c-bog9v3-ANY]
aws_iam_role_policy.s3_read_access_policy: Refreshing state... [id=ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-gcp9dahm4c-qorb7e-GET-200]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-gcp9dahm4c-ogj40z-GET-200]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=zfeccr]
aws_api_gateway_integration.openapi_swagger: Refreshing state... [id=agi-gcp9dahm4c-qorb7e-GET]
aws_api_gateway_integration.openapi_swagger_assets: Refreshing state... [id=agi-gcp9dahm4c-ogj40z-GET]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_lambda_permission.siteminder-tests-scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_cloudwatch_event_target.siteminder-tests-scheduler: Refreshing state... [id=siteminder-tests-scheduler-siteminder-tests-scheduler]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_api_gateway_integration_response.openapi_swagger: Refreshing state... [id=agir-gcp9dahm4c-qorb7e-GET-200]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_api_gateway_integration_response.openapi_swagger_assets: Refreshing state... [id=agir-gcp9dahm4c-ogj40z-GET-200]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.app: Refreshing state... [id=agi-gcp9dahm4c-bog9v3-ANY]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-gcp9dahm4c-uysksd-ANY]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=i2174j]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-10-28T00:23:32.968Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-10-28T00:23:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "u658zcxxGfINtI2fNX89AR731L0eGyx8WbX2oEU+vrU=" -> "yBbxLMpghOnNRBU5WFu9g7YMkW26WQkJrroAni+7TMM="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-10-28T00:23:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "V5iqX1HW8eRCxNcEUBobls9ZhN/xNPx8AFHD583I8UM=" -> "qBglwF9MR0ZDb5fGuRN3QAYNZU+0HpHe69uvsmwBmkk="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-10-28T00:23:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "rYqTOYze1b0OYkGobjM4hir0Ltr6C/XDT4hECddo8cg=" -> "7k7q4xU4N2kCA4E+ZuXnt1OmuNgJEJo+OWHO9o/K/JU="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-10-28T00:23:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "pGzVSIgT93kaCWHFjO1RHywG4FM8oHmMQL2qOlIh/Hk=" -> "8sHWVbgKcyswftUBiVf73SRHQGZGlU+czsRrNgNm18Q="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-10-28T00:23:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "IlpsSnF9jVqg6r3MheG2F9e2Y7ZluNYVDd81drPG0Fk=" -> "frjbBV/W2xnzU86JVXHsKb4eGBoIOW/55ySQv3N2xDk="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.siteminder-tests-scheduler will be updated in-place
  ~ resource "aws_lambda_function" "siteminder-tests-scheduler" {
        id                             = "lambda-siteminder-tests-scheduler"
      ~ last_modified                  = "2022-10-28T00:23:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "5d8fHzBpL/+A7H/xQmNSLlV7nDZFUP8+zHJp6OohfBc=" -> "iNp3TaqXuwZa0g3vH/87zMSI+Ze7C2b95s6giD68Z6w="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_s3_object.swagger_dist["swagger-output.json"] will be updated in-place
  ~ resource "aws_s3_object" "swagger_dist" {
      ~ etag               = "754e292cecae4720202eef8520b3d38b" -> "06b0baa5c2594ab2d75e1df345ff176f"
        id                 = "swagger-output.json"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-10-28T00:23:32.968Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 34 estimated
           $178.56/mo +$0.0

```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*